// let weather = {

// apikey:"3a9dbd059f69ed125eb5d94cb10699b9",
// fetchWeather: function (city){
//     fetch("https://api.openweathermap.org/data/2.5/weather?q="
//           + city 
//           + "&units=metric&appid="
//           + this.apikey
//         )
//     // يعني استبدلنا الاي بي كي الموجود بالفاريبل يعني بدل ما اكتب القيمة اكتب الفاريبل اخر شي 
// .then((response)=> response.json())
// .then((data) =>console.log(data));

// },
// displayweather : function(data){

// }
// };
// هنا هنسوي اوبجكت عشان نخزن الفنكشن والمتغيرات المهمة 
// اول شي بنحتاج اتوقع نعمل فاريبل نحط جواه الكي الي بناخذه من الويثر اي بي اي ماب
// بعدين الموقع هذا قصة عشان نجيبه
// بس نعمل فنكشن اسمها فتش الويثر فتش تعني باللي اعرفه جيب البيانات

// افهمي الي قبل بس الي وصلته بعد كتابة فنكشن  فيتش ويذر وبعد ما حطيت الرابط اقدر اكتب بكونسل الموقع حقي كل ويذر اسم الاوبجكت دوت اسم الفنكشن فيتش ويذر ونرسل اسم المدينة يطلع درجة الحرارة وكذا بقي ديسبلاي ويذر
// طبعا ليش قلنا نجرب الفنكشن بالكونسول عشان اتوقع ما نقدر نكتب الانبوت ولا نضغط البتن عشان لسه ما اشتغلنا عليهم اهم شي الحين كيف نجيب البيانات من الاي بي اي واحطهم بميثود بطريقة مناسبة عشان اجيب بيانات طقس كل مدينة

//طريقة نور حمصي بجلب البيانات يعني فتش البيانات من اي بي اي هو استخدم بريكنق باد اي بي اي انا بجرب اوبن ويذر اي بي اي
// فيتش يعني جلب البيانات ويقول الفتش هو نفسه بروميس بس الطريقة القديمة الحين الي بكتبه الطريقة الجديدة لجلب البيانات

async function get(city){
     const apikey="3a9dbd059f69ed125eb5d94cb10699b9";
    const response = await fetch(" https://api.openweathermap.org/data/2.5/weather?q= "+ city +"&units=metric&appid=" + apikey);
//    " https://api.openweathermap.org/data/2.5/weather?q= "+ city +&appid= + apikey
    // هنجيب كل البيانات من الاي بي اي ونحطها بفاريبل اسمه ريسبونس 
    // اويت هنا بتقول انتظر لنجيب نعمل فيتش جلب كل البيانات من الاي بي اي بعدين حطها بالفاريبل 
    const data = await response.json()
    // هنا الي فهمته نستنى لين يعمل ريسبونس بصيغة جيسون ويحطها بالداتا
    console.log(data);
    // اتوقع الحين الداتا بتنطبع بصيغة جيسون طبعا لازم نستدعي الداتا
    displayWeather(data);
    // نادينا لدالة هذي عشان لما بناديها من برا ما بتعرف قيمة الداتا عشان عرفناها هنا وبطلي غباء لا ترسلي لها اسم مدينة ترا المفروض ملف جيسن وهي تاخذ منه اسم المدينة والايكون وكذا
}
/*
الحمدلله اشتغل الي صار هذي طريقة حديثة لفيتش داتا من اي بي اي خارجي باستخدام جافا سكربت
اول شي نكتب اي سينك يعني غير متزامنة يعني نستخدمها لما يكون عندنا فنكشن تاخذ وقت طويل ف ما بدنا توقف باقي الكود  يعني كمل باقي الكود وانا لما اخلص بعطيك النتيجة
الفنكشن سميتناها قت واعطيناها ستي بمعنى اناديك وارسل لك ستي اعطيني بيانات الويذر
اذا الاي بي اي لازم لها ابي كي اعمليه كونستنت حطي = بعدها القيمة 
بعدها الريسبونس هنا سهلة هنعمل ايه ويت يعني استنى لين ما نجيب البيانات من الموقع  وحطها جوا ريسبونس
بعدها بنحول الريسبونس لجي سون عشان اتوقع اسهل بالقراءة ونطبع الداتا
بعدها مارح تشتغل الفنكشن الا اذا نادينها 
طيب كيف نجيب الرابط ؟ نروح لموقع الاوبن وذر اي بي ايه بعدين نسجل دخول بعدها نجيب الاي بي اي كيي الرابط نفسه لازم ندخل 
current weather data doc يعني اول شي تدخل على الاي بي اي حقت الموقع عادي بعدين هذا هتلاقي الرابط عند شي زي الويذر داتا يوزنق ستي نايم 
تستبدلي البرايسسز ب + تحطي السيتي والاب اي دي الي هو نفسه الاي بي اي كي 
اي برامتر حابة تضيفه زي يونتس = مترك حطيه قبل الاب اي دي هذا استنتاجي ولا تنسي 
&
عشان تكون بدل فهرنهايت سلسيوز
*/

function displayWeather(data){
    const {name} = data;
    // يعني عندنا ملف الجيسن كيف تجيبه؟ حطي الرابط عوضي بالستي نايم والاب اي دي
    // هنا هو رح يستخرج النايم من الداتا تذكري الداتا اعطينها قيمه ريسبونس. جاي يونت ناخذ منهنا النايم الي هو اسم المدينة ونتعامل معه على اساس انه متغير
    const {description , icon} = data.weather[0];
    // مهم هنا نحط الايكون والوصف مع بعض عشان كلهم موجودين في الارراي ويذر الي فيه اوبجكت 0 
    const {temp , humidity} = data.main;
    const {speed} = data.wind;
    console.log(name , icon, description, temp , humidity , speed);
    document.querySelector(".city").innerText="Weather in " +name;
    // عشان تختبري اذا اسم المدينة ظهرت في البوكس روحي الكونسول واكتبي اسم اليمثود قت وارسلي اسم المدينة
    document.querySelector(".temperature").innerText = temp + "°C";
    // كتبتها لحالي شاطرة والله عرفتي ليه حطينا اسماء كلاسات للعناصر اتش تي ام ال عشان نناديهم بالسلكت كويري
    document.querySelector(".wind").innerText ="Wind speed : "+ speed +" km/h";        
    // im so happpppppppyyyy انتي متخلية انو جبنا الداتا من ملف جيسن قصدي من الكونسول يعني وعرضناها في الشاشة :))))))))))) 
    document.querySelector(".humidity").innerText = "Humidity : " + humidity + " %" ;
    document.querySelector(".description").innerText = description;
    document.querySelector(".icon").src = "https://openweathermap.org/img/wn/"+icon+"@2x.png";
    // شوفي نستخدم دوكيومنت دوت كويري سلكتور نحط اسم الكلاس نستخدم البروبرتي سورس عشان نعطيها سورس الرابط ضروري نحطه في كوتيشن مارك جبته اني كتبت اوبن ويذر اي بي اي ايكونز دخلت الصفحة فتحت الايكون في ضفحة لوحدها نسخت الرابط بس ضروري اشيل اسم الايكون احط بداله الايكون الي جبناه فوق من الاوبجكت 0 من الارراي صفر يعني تذكري لما ننادي الداتا ونخليها جيسون وعرضناها جبنا كل داتا وحطيناها بمتغير لوحدها

}
function search(){
    const cit = document.querySelector(".search-bar").value;
    // الفكرة انو اول ما يفتح الصفحة
    document.querySelector(".card").style.cssText =`margin:  230px auto;
     width:540px;
     height: 440px;
     background: linear-gradient(to bottom, #ffffff 40%, #ffffff 100%);
     opacity: 80%;
     padding: 30px;
     border-radius:17px;
     border:7px solid  #43abd456;";
     `
    //  إذا حابة quotes عادية " " → لازم تحطي \ في نهاية كل سطر. طبعا اول كوت عند اول اول خاصية والثاني عند اخر اخر خاصية استخدمنا سي اس اس تكست عشان cssText يسمح لك تكتبي كل CSS كسلسلة نصية مثل الـ CSS العادي. وممكن نحيب العنصر بكويري لسكتور نحطه في متغير اقول لكل خاصية اسم المتغير دوت ستايل دوت اسم الخاصية زي مارجن يساوي كوتيشن ماركس 

//لو استخدمتي backtick ` → تقدر تكتبي كل شيء على أكثر من سطر بدون مشاكل → هذا اللي أنصحك فيه دائمًا.

    document.querySelector(".weather").style.display="block";
    get(cit);

    // المنطق هنا حقي الحمدلله كويس بس كان لازم اطلع الفنكشن برا يعني ما اعرف الفنكشن جوا اللسنر مدري ليه
}



document.querySelector(".search-button").addEventListener("click" ,search);
// هنا في اد لسنر ضروري ما نحط اقواس عشان لو حطينها بتتنقذ قبل ما اليوزر يعمل كليك كذا فهمت ف اليوزر يضغط الزر تتنقذ الفكنشن ننادي السيرش بار ناخذ قيمته نرسلها الى قت الي اصلا تجيب بيانات الستي بعدين تعرض البيانات

// document.querySelector(".search-bar").addEventListener("keyup", search)
//  ذي اكتشفتها بالصدفة اول ما تكتي يبا يحزر دول بدون ما تضغطي انتر او سرش بتن

document.querySelector(".search-bar").addEventListener("keyup", function(event){
    if(event.key == "Enter"){
        search();
    }
});



